#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # dnsimple_zone_record.records_a["api"] will be created
  + resource "dnsimple_zone_record" "records_a" {
      + id             = (known after apply)
      + name           = "api"
      + priority       = (known after apply)
      + qualified_name = (known after apply)
      + ttl            = "3600"
      + type           = "A"
      + value          = "172.17.0.1"
      + zone_id        = (known after apply)
      + zone_name      = "amazon.works"
    }

  # dnsimple_zone_record.records_a["web_1"] will be created
  + resource "dnsimple_zone_record" "records_a" {
      + id             = (known after apply)
      + name           = "web"
      + priority       = (known after apply)
      + qualified_name = (known after apply)
      + ttl            = "600"
      + type           = "A"
      + value          = "172.17.0.3"
      + zone_id        = (known after apply)
      + zone_name      = "amazon.works"
    }

  # dnsimple_zone_record.records_a["web_2"] will be created
  + resource "dnsimple_zone_record" "records_a" {
      + id             = (known after apply)
      + name           = "web"
      + priority       = (known after apply)
      + qualified_name = (known after apply)
      + ttl            = "3600"
      + type           = "A"
      + value          = "172.17.0.3"
      + zone_id        = (known after apply)
      + zone_name      = "amazon.works"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + service_map = [
      + "api:api.amazon.works:A:3600:172.17.0.1",
      + "web_1:web.amazon.works:A:600:172.17.0.3",
      + "web_2:web.amazon.works:A:3600:172.17.0.3",
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @weppos, Action: `pull_request`*